### HR Analytics - how likely is it that an employee will leave

In [131]:
# loading data sets
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

train = pd.read_csv('C:/Users/omjee/Documents/Data Science/Vidhya Analytics/Janata Hack_HR Analytics/train_jqd04QH.csv')
test = pd.read_csv('C:/Users/omjee/Documents/Data Science/Vidhya Analytics/Janata Hack_HR Analytics/test_KaymcHn.csv')

In [132]:
# combine train and test 
whole = train.append(test)
whole.head()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,23798,city_149,0.689,Male,Has relevent experience,no_enrollment,Graduate,STEM,3,100-500,Pvt Ltd,1,106,0.0
1,29166,city_83,0.923,Male,Has relevent experience,no_enrollment,Graduate,STEM,14,<10,Funded Startup,1,69,0.0
2,46,city_16,0.910,NaN,Has relevent experience,no_enrollment,Graduate,STEM,6,50-99,Public Sector,2,4,0.0
3,18527,city_64,0.666,Male,Has relevent experience,no_enrollment,Graduate,STEM,14,50-99,Pvt Ltd,1,26,0.0
4,21751,city_100,0.887,NaN,No relevent experience,no_enrollment,Masters,STEM,8,NaN,NaN,2,88,1.0

In [133]:
whole.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 33380 entries, 0 to 15020
Data columns (total 14 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   enrollee_id             33380 non-null  int64
 1   city                    33380 non-null  object
 2   city_development_index  33380 non-null  float64
 3   gender                  25894 non-null  object
 4   relevent_experience     33380 non-null  object
 5   enrolled_university     32759 non-null  object
 6   education_level         32528 non-null  object
 7   major_discipline        28149 non-null  object
 8   experience              33277 non-null  object
 9   company_size            24550 non-null  object
 10  company_type            24011 non-null  object
 11  last_new_job            32709 non-null  object
 12  training_hours          33380 non-null  int64
 13  target                  18359 non-null  float64
dtypes: float64(2), int64(2), object(10)
memory usage: 3.8+ MB

In [134]:
# Proportion of data missing in each column
whole.isnull().sum()

enrollee_id                   0
city                          0
city_development_index        0
gender                     7486
relevent_experience           0
enrolled_university         621
education_level             852
major_discipline           5231
experience                  103
company_size               8830
company_type               9369
last_new_job                671
training_hours                0
target                    15021
dtype: int64

### Data cleaning, handling of missing value, data analysis

In [135]:
whole['training_hours'].describe()

count    33380.000000
mean        65.565638
std         60.363572
min          1.000000
25%         23.000000
50%         47.000000
75%         89.000000
max        336.000000
Name: training_hours, dtype: float64

In [136]:
# log Transformation of column 'training hours'
whole['training_hours'] = np.log(whole['training_hours'])
whole['training_hours'].describe()

count    33380.000000
mean         3.759840
std          0.995878
min          0.000000
25%          3.135494
50%          3.850148
75%          4.488636
max          5.817111
Name: training_hours, dtype: float64

In [137]:
whole['last_new_job'].value_counts()

1        13813
>4        6023
2         5133
never     3943
3         1922
4         1875
Name: last_new_job, dtype: int64

In [138]:
whole['last_new_job'].fillna(value='-1', inplace=True)        # filling missing values
whole['last_new_job'] = whole['last_new_job'].replace('never', '0')
whole['last_new_job'] = whole['last_new_job'].replace('>4', '5')
whole['last_new_job'].value_counts()

1     13813
5      6023
2      5133
0      3943
3      1922
4      1875
-1      671
Name: last_new_job, dtype: int64

In [139]:
whole['company_type'].value_counts()

Pvt Ltd                18114
Funded Startup          1880
Public Sector           1792
Early Stage Startup     1029
NGO                      973
Other                    223
Name: company_type, dtype: int64

In [140]:
whole['company_type'].fillna(value='unknown', inplace=True)      # filling missing values
whole['company_type'].value_counts()

Pvt Ltd                18114
unknown                 9369
Funded Startup          1880
Public Sector           1792
Early Stage Startup     1029
NGO                      973
Other                    223
Name: company_type, dtype: int64

In [141]:
whole['company_size'].value_counts()

50-99        5697
100-500      4845
10000+       3666
10/49        2664
1000-4999    2513
<10          2464
500-999      1639
5000-9999    1062
Name: company_size, dtype: int64

In [142]:
whole['company_size'].fillna(value='unknown', inplace=True)        # filling missing values
whole['company_size'] = whole['company_size'].replace('10/49', '10-49')    # replacing
whole['company_size'].value_counts()

unknown      8830
50-99        5697
100-500      4845
10000+       3666
10-49        2664
1000-4999    2513
<10          2464
500-999      1639
5000-9999    1062
Name: company_size, dtype: int64

In [143]:
whole['experience'].fillna(value='-1', inplace=True)          # filling missing values
whole['experience'].value_counts()
#whole.groupby('experience').count()

>20    6150
5      2400
4      2240
3      2166
6      2039
7      1779
2      1756
10     1753
9      1722
8      1423
15     1244
11     1190
14     1080
16      964
12      905
1       818
<1      782
13      763
17      659
19      590
18      533
20      321
-1      103
Name: experience, dtype: int64

In [144]:
whole['experience'] = whole['experience'].replace('<1', '0')
whole['experience'] = whole['experience'].replace('>20', '21')
whole['experience'] = whole['experience'].astype('int32')

In [145]:
#whole['experience'].value_counts().index
whole['experience'].value_counts()

 21    6150
 5     2400
 4     2240
 3     2166
 6     2039
 7     1779
 2     1756
 10    1753
 9     1722
 8     1423
 15    1244
 11    1190
 14    1080
 16     964
 12     905
 1      818
 0      782
 13     763
 17     659
 19     590
 18     533
 20     321
-1      103
Name: experience, dtype: int64

#### Sorting values into bins

In [146]:
bins = [-1, 0, 3, 6, 9, 12, 15, 18, 21]
labels = ['unknown', 'exp_level1', 'exp_level2', 'exp_level3', 'exp_level4', 'exp_level5', 'exp_level6', 'exp_level7']
whole['experience'] = pd.cut(whole['experience'], bins=bins, labels=labels, right=False)
whole['experience'].value_counts()

exp_level2    6806
exp_level3    5241
exp_level4    4665
exp_level1    3356
exp_level6    2867
exp_level5    2748
exp_level7    1444
unknown        103
Name: experience, dtype: int64

In [147]:
whole['major_discipline'].fillna('unknown', inplace=True)     # filling missing values
whole['major_discipline'].value_counts()

STEM               24855
unknown             5231
Humanities          1212
Other                678
Business Degree      585
Arts                 432
No Major             387
Name: major_discipline, dtype: int64

In [148]:
whole['education_level'].fillna(value='unknown', inplace=True)      # filling missing values
#whole['education_level'].value_counts()

In [149]:
whole['city'].value_counts().head(10)

city_103    7852
city_21     3022
city_16     2928
city_114    2706
city_160    1531
city_136    1088
city_67      821
city_75      598
city_102     573
city_104     555
Name: city, dtype: int64

In [150]:
whole['city_development_index'].describe()

count    33380.000000
mean         0.846934
std          0.109972
min          0.448000
25%          0.794000
50%          0.910000
75%          0.920000
max          0.949000
Name: city_development_index, dtype: float64

In [151]:
whole['gender'].fillna(value='unknown', inplace=True)         # filling missing values
whole['gender'].value_counts()

Male       23462
unknown     7486
Female      2085
Other        347
Name: gender, dtype: int64

In [152]:
whole['relevent_experience'] = whole['relevent_experience'].replace('Has relevent experience', '1')
whole['relevent_experience'] = whole['relevent_experience'].replace('No relevent experience', '0')
print(whole['relevent_experience'].value_counts())

1    24698
0     8682
Name: relevent_experience, dtype: int64

In [153]:
whole['enrolled_university'].fillna(value='unknown', inplace=True)       # filling missing values
whole['enrolled_university'].value_counts()

no_enrollment       24887
Full time course     5752
Part time course     2120
unknown               621
Name: enrolled_university, dtype: int64

In [155]:
whole.head()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,23798,city_149,0.689,Male,1,no_enrollment,Graduate,STEM,exp_level2,100-500,Pvt Ltd,1,4.663439,0.0
1,29166,city_83,0.923,Male,1,no_enrollment,Graduate,STEM,exp_level5,<10,Funded Startup,1,4.234107,0.0
2,46,city_16,0.910,unknown,1,no_enrollment,Graduate,STEM,exp_level3,50-99,Public Sector,2,1.386294,0.0
3,18527,city_64,0.666,Male,1,no_enrollment,Graduate,STEM,exp_level5,50-99,Pvt Ltd,1,3.258097,0.0
4,21751,city_100,0.887,unknown,0,no_enrollment,Masters,STEM,exp_level3,unknown,unknown,2,4.477337,1.0

In [154]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
le.fit_transform(level)

array([4, 3, 2, 1, 0], dtype=int64)